Repository: seanpm2001/mt-training-data
Catalog: nso/nso_pontoon.tmx
Source language: en_us
Languages: nso

source: Report was passed successfully
nso: Pego e fetile ka katlego

source: Request a Language
nso: Kgopela polelo

source: Request recordings
nso: Kgopela dipego

source: *required
nso: *nyakega

source: Re-record
nso: Rekhota gape

source: Re-record clip
nso: Rekhota pego ya odio gape

source: Reset skipped sentences
nso: Thoma leswa mafoko ka moka ao wa tshetšego

source: Return
nso: Bušetša

source: Return here to edit your goal anytime.
nso: Boela mo go rulaganya pakane ya gago neng le neng.

source: Return to Common Voice
nso: Boela go Common Voice

source: Return to Common Voice Datasets
nso: Boela go dathasete ya Common Voice

source: Return to Languages
nso: Boela go Maleme

source: Review
nso: Hlahloba

source: Review could not be saved. Please try again later.
nso: Hlahlobo e paletšwe ke go bolokwa> Re kgopela o leke gape ka morago.

source: ⓘ Review Criteria
nso: ⓘ Hlahloba Kriteria

source: Review Criteria
nso: Hlahloba Kriteria

source: Reviewed sentences not submitted, are sure?
nso: Mafoka a ahlotšweng a se a tsene, na o kgodišegile?

source: <reviewLink>Review now!</reviewLink>
nso: <reviewLink>Hlahloba bjale!</reviewLink>

source: Review & re-record clips here as you go
nso: Hlahloba o gatiše pego gape mo ge o dutše o tšwelapele

source: Review & re-record clips if needed
nso: Hlahloba o dira di pego gape ge e ba go hlokagala

source: Review sentences
nso: Poeletšo ya mafoko

source: Review Sentences
nso: Hlahloba Mafoko

source: Review & Submit
nso: Hlahloba o Romele

source: Romanian
nso: Se-Romania

source: Romansh Sursilvan
nso: Se-Romansh Sursilvan

source: Romansh Vallader
nso: Se-Romansh Vallader

source: Runyankole
nso: Se-Runyankole

source: Russian
nso: Se-Russia

source: Sakha
nso: Se-Sakha

source: Santali (Ol Chiki)
nso: Se-Santali (Ol Chiki)

source: Saraiki
nso: Se-Saraiki

source: Sardinian
nso: Se-Sardinia

source: Save
nso: Boloka

source: Saved
nso: Bolokegile

source: Search
nso: Nyakiša

source: Search for answers
nso: Nyaka dikarabo

source: Search for them on the Internet
nso: Di nyake Inthaneteng

source: See how your progress compares to other contributors all over the world.
nso: Bona kamoo tšwelopele ya gago e bapišwago le baneedi ba bangwe lefaseng ka bophara.

source: See Less
nso: Bona ga Nyenyane

source: See More
nso: Bona go Feta

source: Select a Language...
nso: Kgetha Leleme...

source: Selected
nso: Kgethilwego

source: Select Language
nso: Kgetha Leleme

source: Send sign up link
nso: Romela linke ya go ngwadiša

source: Sentence Collection
nso: Kgobokanyo ya Mafoko

source: <sentenceCollectorFragment>See more on sentence collection</sentenceCollectorFragment>.
nso: <sentenceCollectorFragment>Bona go feta ka kgobokanyo ya mafoko </sentenceCollectorFragment>.

source: <sentenceCollectorVideo>Watch our guide on using the Sentence Collector</sentenceCollectorVideo>.
nso: <sentenceCollectorVideo>Lebelela ditaetši tša rena go tseba go šomiša Molekgetho wa Mafoko </sentenceCollectorVideo>.

source: Sentence must contain between 1 and 14 (inclusive) words
nso: Lefoko le be le mantšu a go tloga go 1 go ya go 14 (ka go akaretša)

source: Sentences
nso: Mafoko

source: { $sentences } added by you
nso: { $sentences } a tsentšwego ke wena

source: Sentences are being uploaded. This can take several minutes depending on the number of sentences added. Please do not close this website.
nso: Mafoko a tsenywa. Se se ka tšea metsotso e mmalwa go ya ka gore ke mafoko a ma kae a tsenywago. Re kgopela o se ke wa tswalela wepesaete.

source: Sentences are collected for people to read aloud.
nso: Mafoko a kgobokeditšwe gore batho ba balele godimo.

source: Sentence should not contain abbreviations
nso: Mafoko a se ke a ba le dikhutsofatšo

source: Sentence should not contain numbers
nso: Mafoko a se ke a ba le dinomoro

source: Sentence should not contain symbols
nso: Mafoko a se ke a ba le maswao

source: Sentences must be reviewed and accepted by two people to be included in Common Voice. You create guidelines for your language <languageGuidelinesLink>here</languageGuidelinesLink>. Sentences must be in the <licenseLink>public domain</licenseLink> and shorter than 15 words. You can ask the owner of a text to make it <waiverLink>CC0 using our waiver process</waiverLink>, and send to us on commonvoice@mozilla.com
nso: "Mafoko a swanela go hlahlobja le go amagelwa ke batho ba babedi gore di tsenywe mo go Common Voice. O hlangwa tlhahlo mabapi le tša polelo ya geno <languageGuidelinesLink> mo</languageGuidelinesLink>. Mafoko a swanetše go ba<licenseLink> lefelong la batho bohle</licenseLink> gomme le be kopana go fetwa/ka tlase ga mantšu a 15. O ka kgopela mong wa mongwalo go e dira <waiverLink>CC0 o šomiša mokgwa wa rena wa go tlogela</waiverLink>, gomme o re romele go commonvoice@mozilla.com"

source: Sentences not submitted, are you sure you want to leave?
nso: Ga se o tsenya mafoko, na o kgonthišiša gore o nyaka go tšwa?

source: { $sentences } sentences failed
nso: { $sentences } mafoko a paletšwego

source: { $sentences } sentences reviewed. Thank you!
nso: { $sentences } mafoko a šetše a hlahlobotšwe. Rea leboga!

source: Sentences that have been validated are exported on Wednesdays, and are available after the next release.
nso: Mafoko a kgonthišitšweng a romelwa ka laboraro, a tle a be gona ka morago ga tše tlo lokollwa tše latelago.

source: Sentence text
nso: Mafoko a lengwalo

source: Serbian
nso: Se-Serbia

source: Set a goal
nso: Ipeele pakane

source: Set my visibility
nso: Bontšha ponagalo yaka

source: Settings
nso: Dilaolatirišo

source: Share Common Voice
nso: Abelana ka Common Voice

source: Share my goal
nso: Abelana ka pakane yaka

source: Share your clip
nso: Abelana ka pego ya gago

source: Share your { $count } Clip Daily Goal for { $type }
nso: Abelana ka { $count } Pakane ya gago ya Letšatši ya Pego ya { $type }

source: Share your { $count } Clip Weekly Goal for { $type }
nso: Abelana ka { $count } Pakane ya gago ya Beke ya Pego ya { $type }

source: Shilha
nso: Se-Shilha

source: Shortcuts
nso: Kgaoletšo

source: Show all skipped sentences again
nso: Bontšha mafoko ka moka ao wa tshitšeng gape

source: Show my ranking
nso: Bontšha boemo bjaka

source: Sicilian
nso: Se-Sisilia

source: Sign up
nso: Ngwadiša

source: Sign up for an account
nso: Ngwadiša go hwetša akhaonte

source: Sign up for Common Voice newsletters, goal reminders and progress updates
nso: Ngwadiša go lengwalo la ditaba la Common Voice, dikgopotšo tša pakane le di tsebišo ka tšwelopele

source: sign up for email updates
nso: ngwadiša go hwetša mpshafatšo go e-meile

source: Sign up for { $lang } updates:
nso: Ngwadiša { $lang } go mpshafatša:

source: Single ZIP file containing
nso: Faele e tee ya ZIP e nang le

source: Sinhala
nso: Se-Sinhala

source: Siswati
nso: Seswati

source: Size
nso: Bogolo

source: Skip
nso: Taboga

source: Skip Submission Feedback
nso: Tshela Tsebišo ya Tshedimošo

source: Slovak
nso: Se-Slovak

source: Slovenian
nso: Se-Slovenia

source: Social media
nso: Poledišano ya inthaneteng

source: Somali
nso: Se-Somali

source: Some languages have enormous variation in grammar, vocabulary and pronunciation. For this reason, we are <ctaLink>introducing ‘Variants’</ctaLink> in 2022. This gives communities a way to distinguish their languages within the larger dataset.
nso: Dipolelo tše dingwe di na le phapano e kgolo ya popolelo, tlotlontšu le mmiletšo ya mantšu. Ka lona lebaka le, re hlagiša <ctaLink> ‘Mehuta e fapanego’ </ctaLink> ka 2022. Se se nea setšhaba mokgwa wa go kgetholla maleme bona ka gare ga dathasete e kgolwanyane.

source: Someone asks for a language to be added.
nso: Go nale motho wo a kgopelang gore polelo e okeletšwe.

source: Something went wrong with reCAPTCHA. Please try again.
nso: Go nale se phošo e diregilego ka reCAPTCHA. Re kgopela o leke gape.

source: Sorbian, Lower
nso: Se-Sorbian, Lower

source: Sorbian, Upper
nso: Se-Sorbian, Upper

source: Sorry, Common Voice is running slowly. Thanks for your interest.
nso: Maswabi, Common Voice e šoma ka go nanya. Re leboga kgahlego ya gago.

source: Sorry, something went wrong
nso: Maswabi, go nale phošo e diregilego

source: Source: { $sentenceSource }
nso: Mothopo: { $sentenceSource }

source: Source: { $source }
nso: Mothopo: { $source }

source: Southern Sotho
nso: Sesotho

source: Spanish
nso: Sepaniši

source: Speak
nso: Bolela

source: Speakers
nso: Diboledi

source: Speaking
nso: Go bolela

source: Speaking and Listening
nso: Go Bolela le go Theeletša

source: Speak in your normal voice! The way you speak is welcome here - we want your accent as it is, and we want your usual volume, style and intonation.
nso: Bolela ka lentšu la gago le le tlwaelegilego! Tsela yeo o bolelago ka yona e amogelegile mo - re nyaka mmolelo wa gago kamoo o lego ka gona, gomme re nyaka modumo wa gago wa lentšu o tlwaelegilego, setaele le segalo sa lentšu.

source: Speak now
nso: Bjale Bolela

source: Speak up, contribute here!
nso: Bolela, neela mo!

source: <speechBlogLink>Get Started with Speech Recognition</speechBlogLink>
nso: <speechBlogLink>Thoma ka Tlhathollo ya Mantšu </speechBlogLink>

source: Speech is often the most natural way we communicate with each other and voice technologies are bringing that convenience to our computers and mobile devices. We want to empower developers to build amazing voice recognition applications like real-time translators and voice-enabled digital assistants. But right now most of the voice data required to build these kinds of apps is expensive and proprietary. We hope the Common Voice dataset will give developers what they need to innovate and make speech technology available in their own language. To make voice recognition even more universal, we're collecting voice samples in widely spoken languages as well as those with a smaller population of speakers often underserved by commercial speech recognition services. Publishing a diverse dataset of voices will empower developers, entrepreneurs, and entire speech communities to address this gap themselves.
nso: Gantši polelo ke tsela ya tlhago yeo re boledišanago ka yona ebile ditheknolotši tša lentšu di tliša boiketlo bjo go dikhomphutha tša rena le didirišwa sa elekroniki. Re nyaka go matlafatša bahlagiši go aga didirišwa tše di botse tša go kwa lentšu bjalo ka bafetoledi ba nako ya kgonthe le bathuši ba ditithale tša go hlaboša mantšu. Eupša ga bjale bogolo bja datha ya lentšu yeo e hlokagalago go aga mehuta ye ya disebedišwa di bitša tšhelete ya godimo ebile e na le thepa. Re holofela gore Datha-set ya Common Voice e tla nea batho ba go hlagiša seo ba se hlokago go thoma le go dira gore theknolotši ya polelo e hwetšegale ka maleme a bona. Go dira gore tlhathollo ya mantšu e lemogwe lefaseng ka bophara, re kgoboketša disampole tša mantšu ka dipolelo tše di bolelwago ke batho ba bantši kudu le baboledi ba dihlopha tše nyenyane tšeo di sa hlokomelegilego ke ditshebeletšo tša dikgwebo. Go phatlalatša pokelelo ya datha tšeo di fapanego go tla matlafatša ba hlagišo, bo rakgwebo, le setšhaba ka moka sa dipolelo go rarolla sekgoba se ka bobona.

source: Speech-to-text (STT)
nso: Sefetošetšadigwalwa mantšung (STT)

source: Speech-to-text (STT) technologies convert voice data into text.
nso: Dithekinolotši tša Sefetošetšadigwalwa mantšung (STT) di fetola di datha tša lentšu go mangwalo.

source: Split into { $archiveCount } ZIP files containing
nso: Aroganya go { $archiveCount } di faele tša ZIP tše swerego

source: Splits
nso: Aroganago

source: Start recording
nso: Thoma pego

source: Start typing to describe your accent
nso: Thoma go thaepa go hlalosa mokgwa wa gago wa go bolela

source: Statistics
nso: Dipalo-palo

source: Stats
nso: Di-Stats

source: Status Page
nso: Boemo bja Letlakala

source: Streaks
nso: Mothaledi

source: <strong>[Crackle]</strong> giant dinosaurs of <strong>[crackle]</strong> -riassic.
nso: <strong>[Crackle]</strong> dinosaurs e kgolo ya <strong>[crackle]</strong> -riassic.

source: <strong>Do not reject clips where the speaker ‘has an accent’ that is different to your own</strong> - this is important for voice recognition to work better for everyone.
nso: <strong>O se ke wa gana ditsopolwa moo seboledi ‘seo se nago le mmolelo’ woo o fapanego le wa gago</strong> - seo se bohlokwa gore temogo ya lentšu e šome kaone bakeng sa batho bohle.

source: <strong>Get creative!</strong> Your language community will be unique, and these are just a few ways to get started.
nso: <strong>Diriša bohlale!!</strong> Polelo ya geno e tla ba moswananoši, tše ke ditsela tše mmalwa tša go thoma.

source: <strong>Sentence Collector</strong> is a tool for collecting and validating public domain sentences. You will <scAccountLink>need to create an account</scAccountLink>. Then, add your language to your <strong>Profile</strong>. You can <strong>Add</strong> sentences or <strong>Review</strong> previously-added sentences.
nso: <strong>Molekgetho wa Mafoko</strong> ke sedirišwa sa go kgoboketša le go netefatša dipolelo tša setšhaba. O tla hloka<scAccountLink>go hlangwa akhaonte</scAccountLink>. Ke moka, tsentšha polelo ya gago go <strong>profaeleng ya gago</strong>. O ka <strong>tsenya mafoko</strong> goba wa <strong>ahla-ahla </strong> mafoko a tsentšhitšego nakong e fetilego.

source: <strong>[Sneeze]</strong> The giant dinosaurs of the <strong>[cough]</strong> Triassic.
nso: <strong>[Sneeze]</strong> Dinosaur e kgolo ya <strong>[cough]</strong> Triassic.

source: Submission: { $batchId }
nso: Go tsenya tshedimošo: { $batchId }

source: Submission Error
nso: Phošo ya go Romela

source: Submit
nso: Lokela

source: Submit a report
nso: Tliša pego

source: Submit clips
nso: Tsenya dipego

source: Submitted sentences. { $duplicates } sentences were rejected as duplicates.
nso: Mafoko a rometšego. { $duplicates } mafoko a ile a ganwa ka ge e le dilo tše pedi tša go swana.

source: Subscribe
nso: Ngwadiša

source: Success
nso: Katlego

source: Success, profile created!
nso: Katlego, profaele e hlangwe!

source: Swahili
nso: Se-Swahili

source: Swedish
nso: Se-Swedish

source: Swipe right to approve the sentence. Swipe left to reject it. Swipe up to skip it. <strong>Do not forget to submit your review!</strong>
nso: Swaepa ka letsogong la letona go amogela lefoko. Swaepela ka go le tshadi go e gana. Swaepela godimo go e taboga. <strong>Se ke wa lebala go romela maikutlo a gago!</strong>

source: Syriac
nso: Se-Syriac

source: Tagalog
nso: Se-Tagalog

source: Tahitian
nso: Se-Tahitia

source: Taiwanese (Minnan)
nso: Se-Taiwanese (Minnan)

source: Tajik
nso: Se-Tajik

source: Taking several attempts to read a word.
nso: Tšea maiteko a mmalwa a go bala lentšu.

source: Tamil
nso: Se-Tamil

source: Tap
nso: Kgwatha

source: Tatar
nso: Se-Tatar

source: Tatoeba is a large database of sentences, translations, and spoken audio for use in language learning. This download contains spoken English recorded by their community.
nso: Tatoeba ke dathabeise e kgolo ya mafoko, diphetolelo, le mantšu a go bolelwago a odio bakeng sa go dirišwa go ithuta polelo. Tanelouto e e na le Seisemane se se bolelwago sa go rekhotiwa ke setšhaba sa gabo rena.

source: Tell us what you'd like to download:
nso: Re botše gore o ka rata go tanelouta eng:

source: Telugu
nso: Se-Telugu

source: Terms
nso: Leina

source: Thai
nso: Se-Thai

source: Thanks for confirming your account, now let's build your profile.
nso: Rea leboga go tiišetša akhoante ya gago, bjale a re age profaele ya gago.

source: Thanks to contributions from over 259k people in over 50 languages, this data is being used to train speech-enabled applications to better respond to the human voice.
nso: Ka baka la thušo ya batsenyaletsogo go tšwa go batho ba fetago 259k ka maleme a fetago 50, datha tšeo di dirišwa go eteletša di dirišwa tše di kgonago go bolela go arabela gabotse lentšung la motho.

source: Thank you for recording!<lineBreak></lineBreak>Now review and submit your clips below.
nso: Re leboga pego ya gago!<lineBreak></lineBreak> Ga bjale hlahloba o tsenye pego tša gago mo tlase.

source: Thank you for your interest in contributing to { $lang }. We work hard to get every language ready for launch and keep the teams updated via email. If you want to contribute, please provide your email below.
nso: Ke leboga kgahlego ya gago ya go neela go{ $lang }. Re šoma ka matla go dira gore polelo ye nngwe le ye nngwe e itokišetše go thomiša le go dula dihlopha beakanywa ka e-meile. Ge e ba o nyaka go neela, ka kgopelo nea ka e-meile ya gago ka mo tlase.

source: Thank you! You’ve sent a new language enquiry
nso: Rea leboga! O rometše khwiri e mpsha ka polelo.

source: The best sources you can look for are podcasts, transcripts, movie scripts and anything that potential can contain everyday conversations.
nso: Methopo e kaonekaone yeo o ka e nyakago ke di-podcast, di-transcript, mengwalong ya difilimi le eng goba eng e ka bago gona go polediišano tša letšatši le letšatši.

source: The bumblebee sped by.
nso: Nose e ile ya feta ka lebelo.

source: The Clip Graveyard consists of voice clips that didn't make it into the Common Voice dataset. Just like the dataset, the Clip Graveyard is available for download. We would like to thank the following people and organizations for their help with the project:
nso: Setsopolwa sa Graveyard se na le dirakolo tša lentšu tše di sa fihlaho go dathasete ya Common Voice. Bjalo ka dathasete, setsopolwa sa Graveyard ya hwetšagala bakeng sa go tanelouta. Re ka rata go leboga batho le mekgatlo e latelago ka thušo ya bona morerong o:

source: The clip has disrespectful or offensive language.
nso: Setsopolwa se na le polelo e hlokago hlompho goba e kgopišago.

source: The Common Voice dataset complements Mozilla’s open source voice recognition engine Deep Speech. The first version of Deep Speech was released in November 2017 and has continued to evolve ever since. Together with the Common Voice dataset, we believe this open source voice recognition technology should be available to everybody. It’s our hope these technologies will enable developers to build a wave of innovative products and services.
nso: Dathasete ya Common Voice e dumelelana le entšene Deep South ya Mozilla e bolegilego ya go tlhatholla Polelong. Phetolelo ya mathomo ya polelong e tseneletšego ya Deep Speech e lokoloktšwe ka November 2017 gomme esale e tšwela pele ka go fetoga go tloga ka nako yeo. Gotee le dathasete ya Common Voice, re dumela gore theknolotši e e bulegilego go lemoša lentšu e swanetše go hwetšwa ke motho yo mongwe le yo mongwe. Re holofela gore ditheknolotši tše di tla thuša batšweletši go aga ditšweletšwa ke ditirelo tše di mpsha tše dintši.

source: The Common Voice Dataset contains hundreds of thousands of voice samples that help developers build voice recognition tools.
nso: Dathasete ya Common Voice e nale di pego tše makgolo le dikete ya mehlala ya manntšu e thušago ba batšweletša ba agang sedirišwa sa temogo ya lentšu.

source: The Common Voice dataset is an open and publicly available resource that can be used to train a wide variety of speech-enabled applications. To protect the security of our contributors, we ask everyone who downloads the Common Voice dataset to respect contributors’ privacy. All voice clips in the dataset are scrubbed of personally identifying information. When you download the dataset, you agree to not attempt to determine the identity of any contributor. That means you cannot try to link information in the dataset to a contributor’s personal information. You may, however, use the dataset to train speech recognition, speaker recognition, or other applications, by, for instance, linking information in the dataset to other information already in the dataset.
nso: "The Common Voice dathasete ke se dirišwa seo se bolegilego ebile se hwetšagala phatlalatša se ka be rekišwa go eteletšwa mehuta e fapanego ya disebedišwa tša go kgona go bolela. Go sireletša tšhireletšo baneedi ba rena, re kgopela motho yo mongwe le yo mongwe yo a taoneloutago Common Voice go hlompha sephiring sa baneedi. Dikarolo ka moka tša lentšu go dathasete di hlakotšwe boitsebišo bja motho. Ge o taonelouta dathasete, o dumela gore o ka se leke go tseba gore na mothuši ofe goba o fe ke mang. Seo se bolela gore o ka se leke go kgokaganya tsebišo ka dathasete ka boitsebišo bja mothuši. Lege go le bjalo, o ka šomiša dathasete go kwetliša tlhathollo ya mantšu, tlhathollo ya seboledi, goba ditsebišo tše dingwe, ka mohlala, go kgokaganya tsebišo goba boitsebišo bjo bogwe bjo bo šetšeng bo le gona ka dathasete. "

source: The Common Voice dataset is available for download under the <licenseLink>CC0</licenseLink> license on <datasetLink>our Datasets page</datasetLink>. You can also download several other publicly available datasets from the same page.
nso: Dathasete ya Common Voice e hwetšagala bakeng sa go tanelouta ka tlase ga <licenseLink>CC0</licenseLink>laesense ya <datasetLink> letlakaleng la rena la Di-dathasete</datasetLink>. O ka tanelouta didirišwa tše dingwe tše mmalwa tšeo di hwetšagalago phatlalatša letlakaleng la go swana.

source: The Common Voice Sentence Collector has collected { $sentenceCount } sentences in { $languageCount } languages!
nso: Molekgetho wa Mafoko a Common Voice o kgobokeditše { $sentenceCount } mafoko a { $languageCount } a maleme!

source: The count of voice recording hours that have been validated by 2 out of 3 users with a vote of “Yes”. These mark progress toward the overall project 10k hours goal.
nso: Palo ya diiri tša go rekhota lentšu tše netefaditšwego ke bašomiši ba 2 go ba 3 ka bouto ya “Ee”. Tše di swaya tšwelopele go fihlela le go lebana le modiro wa kakaretšo ya diiri tše 10K.

source: The count of voice recording hours we have collected so far.
nso: Dibalwa tša di pego tše re di kgobokeditšego go fihla ga bjale.

source: The giant dinosaur of the Triassic.
nso: Dinosaur e kgolo ya Triassic.

source: The giant dinosaurs of the Triassi-.
nso: Dinosaur e kgolo ya Triassi-.

source: The giant dinosaurs of the Triassic.
nso: Dinosaur e kgolo ya Triassic.

source: The giant dinosaurs of the Triassic. <strong>[read by one voice]</strong>
nso: Dinosaur e kgolo ya Trassic. <strong>[read by one voice]</strong>

source: The giant dinosaurs of the Triassic. Yes.
nso: Dinosaur e kgolo ya Triassic. Ee.

source: The giant dino <strong>[cough]</strong> the Triassic.
nso: Dino e kgolo <strong>[cough]</strong> di Triassic.

source: The goal of the Common Voice dataset is to enable anyone in the world to build speech recognition, speaker recognition, or any other type of application that requires voice data. A voice assistant is just one of many types of applications you could use the dataset to build.
nso: Boikemišetšo bja dathasete ya Common Voice ke go thuša motho lege e le ofe goba ofe lefaseng go aga tlhathollo ya mantšu , tlhathollo ya diboledi, goba mohuta ofe goba ofe wa sedirišwa se hlokago datha ya lentšu. Mothuši wa lentšu ke e nngwe feela ya mehuta e mentši ya didirišwa tšeo di šomišago go aga dathasete.
